//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : HAL東京　ゲーム学科　呉優
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum {
	RESULT_TEXTURE_BG,
	RESULT_TEXTURE_LOGO,
	RESULT_TEXTURE_SCORE,
	RESULT_TEXTURE_PRESSANYKEY,

	RESULT_TEXTURE_NUM,
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);


