//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : HAL東京　ゲーム学科　呉優
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum {
	TITLE_TEXTURE_BG00,			// 背景00
	TITLE_TEXTURE_BG01,			// 背景01
	TITLE_TEXTURE_BG02,			// 背景02

	TITLE_TEXTURE_PRESSANYKEY,	// PRESSANYKEY

	TITLE_TEXTURE_NUM,
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


int GetTitleBgNum(void);